app/Http/Controllers/BendaharaController.php

    public function buatKwitansi(Pembayaran $pembayaran)
    {
        // Cek apakah kwitansi sudah ada untuk pembayaran ini
        $kwitansiExisting = Kwitansi::where('id_pembayaran', $pembayaran->id_pembayaran)->first();
        if ($kwitansiExisting) {
            return $kwitansiExisting; // Jangan buat duplikat
        }

        $noKwitansi = 'KWT-' . date('Ymd') . '-' . $pembayaran->id_pembayaran;

        $kwitansi = Kwitansi::create([
            'id_pembayaran' => $pembayaran->id_pembayaran,
            'no_kwitansi' => $noKwitansi,
            'tanggal_terbit' => now(),
            'file_kwitansi' => 'kwitansi/' . $noKwitansi . '.pdf'
        ]);
---
select * from `kwitansi` where `id_pembayaran` = 2 limit 1
insert into `kwitansi` (`id_pembayaran`, `no_kwitansi`, `tanggal_terbit`, `file_kwitansi`, `updated_at`, `created_at`) values (2, 'KWT-20250820-2', '2025-08-20 04:26:15', 'kwitansi/KWT-20250820-2.pdf', '2025-08-20 04:26:15', '2025-08-20 04:26:15')