app/Http/Controllers/KwitansiController.php

    public function generateAndSave(Pembayaran $pembayaran): ?Kwitansi
    {
        if ($pembayaran->kwitansi) {
            return $pembayaran->kwitansi;
        }

        try {
            // 1. Buat record kwitansi di database terlebih dahulu
            $pembayaran->load(['siswa']);
            $noKwitansi = 'KW/' . now()->year . '/' . now()->month . '/' . $pembayaran->id_pembayaran;
            $kwitansi = Kwitansi::create([
                'id_pembayaran' => $pembayaran->id_pembayaran,
                'no_kwitansi' => $noKwitansi,
                'tanggal_terbit' => now(),
                'file_kwitansi' => '', // Kosongkan dulu, akan diisi nanti

            ]);
---
insert into `kwitansi` (`id_pembayaran`, `no_kwitansi`, `tanggal_terbit`, `file_kwitansi`, `updated_at`, `created_at`) values (6, 'KW/2025/8/6', '2025-08-20 06:01:43', '', '2025-08-20 06:01:43', '2025-08-20 06:01:43')

            $templateProcessor->saveAs($fullOutputPath);

            // 6. Update record kwitansi dengan path file yang baru
            $kwitansi->update(['file_kwitansi' => $databasePath]);
---
update `kwitansi` set `file_kwitansi` = 'kwitansi/kwitansi-11-1757923712.docx', `kwitansi`.`updated_at` = '2025-09-15 08:08:32' where `id_kwitansi` = 10