app/Http/Controllers/MidtransController.php

    public function showForm($id_siswa)
{
    $siswa = Siswa::findOrFail($id_siswa);
    $jumlahSPP = Pengaturan::where('key', 'jumlah_spp')->value('value') ?? 700000;
---
select * from `siswa` where `siswa`.`id_siswa` = '2' limit 1
select `value` from `pengaturan` where `key` = 'jumlah_spp' limit 1

public function createMidtrans(Request $request, $id_siswa)
{
    $siswa = Siswa::findOrFail($id_siswa);

    // Validasi input dasar
    $request->validate([
        'bulan' => 'required|array|min:1',
        'bulan.*' => 'string|in:Januari,Februari,Maret,April,Mei,Juni,Juli,Agustus,September,Oktober,November,Desember',
        'tahun' => 'required|integer',
    ]);

    // =======================================================
    // BLOK VALIDASI ANTI-DUPLIKAT (PERBAIKAN)
    // =======================================================
    $bulanYangDipilih = $request->bulan;
    $tahunYangDipilih = $request->tahun;
    $konflikBulan = [];

    foreach ($bulanYangDipilih as $bulan) {
        $pembayaranSudahAda = Pembayaran::where('id_siswa', $id_siswa)
            ->where('bulan', $bulan)
            ->where('tahun', $tahunYangDipilih)
            ->whereIn('status', ['menunggu', 'diterima']) // Cek jika status 'menunggu' ATAU 'diterima'
            ->exists(); // Cukup cek apakah ada (true/false), lebih efisien
---
select * from `siswa` where `siswa`.`id_siswa` = '1' limit 1
select exists(select * from `pembayaran` where `id_siswa` = '1' and `bulan` = 'Maret' and `tahun` = '2025' and `status` in ('menunggu', 'diterima')) as `exists`

    // AKHIR BLOK VALIDASI
    // =======================================================

    // Lanjutkan proses ke Midtrans jika tidak ada konflik...
    $jumlahSPP = Pengaturan::where('key', 'jumlah_spp')->value('value') ?? 700000;
---
select `value` from `pengaturan` where `key` = 'jumlah_spp' limit 1


    // Simpan pembayaran, buat satu record per bulan
    foreach ($request->bulan as $bulan) {
        Pembayaran::create([
            'id_siswa' => $siswa->id_siswa,
            'bulan' => $bulan,
            'tahun' => $request->tahun,
            'jumlah' => $jumlahSPP,
            'metode' => 'midtrans',
            'status' => 'menunggu',
            'snap_token' => $snapToken,
            'midtrans_order_id' => $orderId,
            'is_midtrans' => true,
        ]);
---
insert into `pembayaran` (`status`, `id_siswa`, `bulan`, `tahun`, `jumlah`, `metode`, `snap_token`, `midtrans_order_id`, `is_midtrans`, `updated_at`, `created_at`) values ('menunggu', 1, 'Maret', '2025', '700000', 'midtrans', 'e2ed012e-2f0d-4437-bf62-8985f5acdc61', 'SISWA-1-1755657648', 1, '2025-08-20 02:40:48', '2025-08-20 02:40:48')