app/Http/Controllers/PembayaranController.php

select * from `siswa` order by `nama_siswa` asc
select `value` from `pengaturan` where `key` = 'jumlah_spp' limit 1
---
    public function createManual()
    {
        $siswa = Siswa::orderBy('nama_siswa')->get();
        $defaultJumlahSPP = Pengaturan::where('key', 'jumlah_spp')->value('value') ?? 0;

select exists(select * from `pembayaran` where `id_siswa` = '1' and `bulan` = 'September' and `tahun` = '2025' and `status` in ('menunggu', 'diterima')) as `exists`
---
    public function storeManual(Request $request)
    {
        // Validasi input
        $request->validate([
            'id_siswa' => 'required|exists:siswa,id_siswa',
            'bulan' => 'required|array|min:1',
            'bulan.*' => 'string',
            'tahun' => 'required|integer|min:2000|max:2100',
            'jumlah' => 'required|numeric|min:0', // Tetap validasi untuk memastikan total di form
            'catatan' => 'nullable|string',
        ]);
        // =======================================================
        // BLOK VALIDASI ANTI-DUPLIKAT (INI PERBAIKANNYA)
        // =======================================================
        $bulanYangDipilih = $request->bulan;
        $tahunYangDipilih = $request->tahun;
        $konflikBulan = [];

        foreach ($bulanYangDipilih as $bulan) {
            $pembayaranSudahAda = Pembayaran::where('id_siswa', $request->id_siswa)
                ->where('bulan', $bulan)
                ->where('tahun', $tahunYangDipilih)
                ->whereIn('status', ['menunggu', 'diterima']) // Cek jika status 'menunggu' ATAU 'diterima'
                ->exists();

select `value` from `pengaturan` where `key` = 'jumlah_spp' limit 1
---
        // Lanjutkan proses penyimpanan jika tidak ada konflik...

        // Ambil jumlah SPP per bulan dari tabel pengaturans
        $jumlahSPP = Pengaturan::where('key', 'jumlah_spp')->value('value') ?? 700000;

insert into `pembayaran` (`status`, `id_siswa`, `bulan`, `tahun`, `jumlah`, `metode`, `verified_by`, `tanggal_verifikasi`, `catatan`, `is_midtrans`, `updated_at`, `created_at`) values ('diterima', '1', 'September', '2025', '700000', 'langsung', 2, '2025-08-20 06:20:18', null, 0, '2025-08-20 06:20:18', '2025-08-20 06:20:18')
---

        // Simpan pembayaran untuk setiap bulan
        foreach ($request->bulan as $bulan) {
            Pembayaran::create([
                'id_siswa' => $request->id_siswa,
                'bulan' => $bulan,
                'tahun' => $request->tahun,
                'jumlah' => $jumlahSPP, // Gunakan jumlahSPP per bulan, bukan $request->jumlah
                'metode' => 'langsung',
                'status' => 'diterima',
                'verified_by' => Auth::id(),
                'tanggal_verifikasi' => now(),
                'catatan' => $request->catatan,
                'is_midtrans' => false,
            ]);

select `value` from `pengaturan` where `key` = 'jumlah_spp' limit 1
select * from `siswa` where `id_wali` = 1 order by `nama_siswa` asc
---
    public function createUpload()
    {
        $defaultJumlahSPP = Pengaturan::where('key', 'jumlah_spp')->value('value') ?? 0;
        // Ambil siswa yang terkait dengan wali murid yang login
        $siswa = Siswa::where('id_wali', Auth::id())->orderBy('nama_siswa')->get();

select * from `siswa` where `id_wali` = 1 and `id_siswa` = '1' limit 1
select exists(select * from `pembayaran` where `id_siswa` = '1' and `bulan` = 'Januari' and `tahun` = '2025' and `status` in ('menunggu', 'diterima')) as `exists`
---
    public function storeUpload(Request $request)
    {
        $request->validate([
            'id_siswa' => 'required|exists:siswa,id_siswa',
            'bulan' => 'required|array|min:1',
            'bulan.*' => 'string',
            'tahun' => 'required|integer|min:2000|max:2100',
            'jumlah' => 'required|numeric|min:0',
            'bukti_transfer' => 'required|image|mimes:jpeg,png,jpg,pdf|max:2048',
            'catatan' => 'nullable|string',
        ]);

        // Validasi bahwa siswa terkait dengan wali murid yang login
        $siswa = Siswa::where('id_wali', Auth::id())->where('id_siswa', $request->id_siswa)->first();
        if (!$siswa) {
            return back()->withErrors(['id_siswa' => 'Siswa tidak valid atau tidak terkait dengan akun Anda.'])->withInput();
        }

        // =======================================================
        // TAMBAHKAN BLOK VALIDASI ANTI-DUPLIKAT DI SINI
        // =======================================================
        $bulanYangDipilih = $request->bulan;
        $tahunYangDipilih = $request->tahun;
        $konflikBulan = [];

        foreach ($bulanYangDipilih as $bulan) {
            $pembayaranSudahAda = Pembayaran::where('id_siswa', $request->id_siswa)
                ->where('bulan', $bulan)
                ->where('tahun', $tahunYangDipilih)
                ->whereIn('status', ['menunggu', 'diterima']) // Cek jika status 'menunggu' ATAU 'diterima'
                ->exists();

select `value` from `pengaturan` where `key` = 'jumlah_spp' limit 1
---
        // AKHIR BLOK VALIDASI
        // =======================================================

        // Lanjutkan proses jika tidak ada konflik...
        $jumlahSPP = Pengaturan::where('key', 'jumlah_spp')->value('value') ?? 700000;

insert into `pembayaran` (`status`, `id_siswa`, `bulan`, `tahun`, `jumlah`, `bukti_transfer`, `metode`, `catatan`, `is_midtrans`, `updated_at`, `created_at`) values ('menunggu', '1', 'Januari', '2025', '700000', 'bukti-transfer/U0zUzLbD5WcEKBkXVxTNV3SSY2bQycZr9BHq8ZF2.jpg', 'transfer', null, 0, '2025-08-20 03:55:28', '2025-08-20 03:55:28')
---
        $path = $request->file('bukti_transfer')->store('bukti-transfer', 'public');

        foreach ($request->bulan as $bulan) {
            Pembayaran::create([
                'id_siswa' => $request->id_siswa,
                'bulan' => $bulan,
                'tahun' => $request->tahun,
                'jumlah' => $jumlahSPP,
                'bukti_transfer' => $path,
                'metode' => 'transfer',
                'status' => 'menunggu',
                'catatan' => $request->catatan,
                'is_midtrans' => false,
            ]);

select * from `pembayaran` where `status` = 'menunggu' and `metode` = 'transfer'
---
    public function indexVerifikasi()
    {
        $pembayaranMenunggu = Pembayaran::where('status', 'menunggu')
            ->where('metode', 'transfer')
            ->with('siswa')
            ->get();

update `pembayaran` set `status` = 'diterima', `pembayaran`.`updated_at` = '2025-08-20 04:26:15' where `id_pembayaran` = 2
insert into `kwitansi` (`id_pembayaran`, `no_kwitansi`, `tanggal_terbit`, `file_kwitansi`, `updated_at`, `created_at`) values (1, 'KWT-20250820-68a548f3d8726', '2025-08-20 04:02:59', 'kwitansi/68a548f3d87f7.pdf', '2025-08-20 04:02:59', '2025-08-20 04:02:59')
---
    public function updateVerifikasi(Request $request, $id)
    {
        $request->validate(['status' => 'required|in:diterima,ditolak']);

        $pembayaran = Pembayaran::findOrFail($id);
        $pembayaran->status = $request->status;
        $pembayaran->save();

        // Buat kwitansi jika diterima
        if ($request->status === 'diterima') {
            // Buat kwitansi langsung tanpa controller lain
            $noKwitansi = 'KWT-' . date('Ymd') . '-' . uniqid();

            $kwitansi = Kwitansi::create([
                'id_pembayaran' => $pembayaran->id_pembayaran,
                'no_kwitansi' => $noKwitansi,
                'tanggal_terbit' => now(),
                'file_kwitansi' => 'kwitansi/' . uniqid() . '.pdf'
            ]);