app/Http/Controllers/RiwayatController.php

    public function index(Request $request)
    {
        $user = Auth::user();
        // Selalu ambil data pembayaran beserta relasi siswa dan kwitansinya
        $query = Pembayaran::query()->with(['siswa', 'kwitansi']);

        // Filter data berdasarkan peran pengguna
        if ($user->role === 'wali_murid') {
            // Jika wali murid, hanya tampilkan data anak-anaknya
            $siswaIds = Siswa::where('id_wali', $user->id)->pluck('id_siswa');
            $query->whereIn('id_siswa', $siswaIds);
        }
        // Jika bendahara atau ketua_yayasan, tidak perlu filter tambahan, mereka bisa melihat semua.

        // Terapkan filter dari form pencarian jika ada
        if ($request->filled('siswa')) {
            $query->where('id_siswa', $request->siswa);
        }
        if ($request->filled('tahun')) {
            $query->where('tahun', $request->tahun);
        }
        if ($request->filled('metode')) {
            $query->where('metode', $request->metode);
        }
        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        // Ambil data yang sudah difilter dan diurutkan, lalu paginasi
        $pembayaran = $query->orderBy('created_at', 'desc')->paginate(10);
---
select `id_siswa` from `siswa` where `id_wali` = 1
select * from `siswa` where `siswa`.`id_siswa` in (1)
select * from `pembayaran` where `id_siswa` in (1, 2) and `status` = 'diterima' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `pembayaran` where `id_siswa` in (1, 2) and `status` = 'diterima'

        // Jika wali murid, dropdown hanya berisi nama anaknya.
        // Jika bendahara, dropdown berisi semua siswa.
        $siswa = ($user->role === 'wali_murid')
            ? Siswa::where('id_wali', $user->id)->orderBy('nama_siswa')->get()
            : Siswa::orderBy('nama_siswa')->get();
---
select * from `siswa` where `id_wali` = 1 order by `nama_siswa` asc
select * from `siswa` order by `nama_siswa` asc